# IndexPoint Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IndexPoint Class
Members See Also
---
A point primitive consisting of one index.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class IndexPoint : IndexPrimitive
```

Visual Basic
---
```text
Public Class IndexPoint _
	Inherits IndexPrimitive
```

Visual C++
---
```text
public ref class IndexPoint : public IndexPrimitive
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.DirectContext3D..::..IndexPrimitive Autodesk.Revit.DB.DirectContext3D..::..IndexPoint
# See Also
IndexPoint Members
Autodesk.Revit.DB.DirectContext3D Namespace